<a href="https://colab.research.google.com/github/DomSarr/data_science_example_1/blob/main/Panda/DataFrame_DataSeries.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
pd.__version__

'2.2.2'

# pd.Series

In [3]:
s = pd.Series(data=[3,2,4,6])
s

0    3
1    2
2    4
3    6
dtype: int64

In [6]:
s = pd.Series(data=[3,2,4,6], index=['a','b','c','d'], name='sample')
s

a    3
b    2
c    4
d    6
Name: sample, dtype: int64

In [7]:
import numpy as np

np.nan - wstawiamy gdy brak wartości, sam odszukuje typ danych

In [10]:
s = pd.Series(data=[3.,np.nan,4,6], index=['a','b','c','d'], name='sample')
s

a    3.0
b    NaN
c    4.0
d    6.0
Name: sample, dtype: float64

In [12]:
s = pd.Series(data=[True,False,False])
s

0     True
1    False
2    False
dtype: bool

wstawianie daty oraz skoku

In [18]:
s = pd.Series(data=np.arange(10,20), index=pd.date_range(start='20200101',periods=10))
s

2020-01-01    10
2020-01-02    11
2020-01-03    12
2020-01-04    13
2020-01-05    14
2020-01-06    15
2020-01-07    16
2020-01-08    17
2020-01-09    18
2020-01-10    19
Freq: D, dtype: int64

In [19]:
s.index

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10'],
              dtype='datetime64[ns]', freq='D')

In [20]:
list(s.index)

[Timestamp('2020-01-01 00:00:00'),
 Timestamp('2020-01-02 00:00:00'),
 Timestamp('2020-01-03 00:00:00'),
 Timestamp('2020-01-04 00:00:00'),
 Timestamp('2020-01-05 00:00:00'),
 Timestamp('2020-01-06 00:00:00'),
 Timestamp('2020-01-07 00:00:00'),
 Timestamp('2020-01-08 00:00:00'),
 Timestamp('2020-01-09 00:00:00'),
 Timestamp('2020-01-10 00:00:00')]

In [21]:
s = pd.Series(data=['python','java','sql'], name='languages')
s

0    python
1      java
2       sql
Name: languages, dtype: object

In [22]:
s.values

array(['python', 'java', 'sql'], dtype=object)

O jak object

In [23]:
s.dtypes

dtype('O')

kształt, 3 wiersze

In [24]:
s.shape

(3,)

# Wycinanie

Nawiasy skośne bo zaczynamy użwać słownika

In [36]:
price = pd.Series(data={'Apple':200,'CD Projekt':60, 'Amazon':1900,'KGHM':np.nan})
price

Apple          200.0
CD Projekt      60.0
Amazon        1900.0
KGHM             NaN
dtype: float64

Szukanie po nazwie

In [27]:
price['CD Projekt']

np.int64(60)

Szukanie po indeksie

In [28]:
price[1]

<ipython-input-28-36dbb2ffbeb5>:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  price[1]

np.int64(60)

Liczenie obiektów

In [37]:
price.count()

np.int64(3)

Sprawdzanie ile razy dana pojawiła się, można dodać również ile jest brakujących danych

In [39]:
price.value_counts(dropna=False)

200.0     1
60.0      1
1900.0    1
NaN       1
Name: count, dtype: int64

In [32]:
price.sum()

np.int64(2160)

In [33]:
price.max()

1900

In [34]:
price.std()

1024.3046421841502

Ogólne dane statystyczne

In [35]:
price.describe()

count       3.000000
mean      720.000000
std      1024.304642
min        60.000000
25%       130.000000
50%       200.000000
75%      1050.000000
max      1900.000000
dtype: float64

Wyszukanie n-ilości najwyższych wartości

In [41]:
price.nlargest(2)

Amazon    1900.0
Apple      200.0
dtype: float64

In [42]:
price.nsmallest(1)

CD Projekt    60.0
dtype: float64

Ranking wartości

In [43]:
price.rank()

Apple         2.0
CD Projekt    1.0
Amazon        3.0
KGHM          NaN
dtype: float64

Sortowanie po wielkości

In [44]:
price.sort_values()

CD Projekt      60.0
Apple          200.0
Amazon        1900.0
KGHM             NaN
dtype: float64

In [45]:
price.sort_values(ascending=False)

Amazon        1900.0
Apple          200.0
CD Projekt      60.0
KGHM             NaN
dtype: float64

funkcja apply

In [48]:
price_pln =price.apply(lambda x:x*3.8)
price_pln

Apple          760.0
CD Projekt     228.0
Amazon        7220.0
KGHM             NaN
dtype: float64

# DataFrame